legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
/***************************************************************************//**
* \file cy_graphics.c
* \version 1.0
*
* Provides an API implementation for Graphics Driver
*
********************************************************************************
* \copyright
* Copyright 2021-2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"
#include <string.h>
#if defined(CY_IP_MXS22GFXSS)

#include "cy_graphics.h"

#if defined(__cplusplus)
extern "C" {
#endif

#define CLEAR_INTERRUPT      (0xFFFFFFFF)
#define GPU_IDLE_MASK        (0x00000b05)
#define CY_GFXSS_WAIT_1_UNIT             (1U)
#define CY_GFXSS_TOTAL_NO_OF_RETRIES     (100U)
#define CLK_SYS_FREQ          (100U)
#define DC_CLK_FREQ_KHZ       (400000U)
#define MIPI_ENTER_SLEEP_MODE (0x10)
#define MIPI_EXIT_SLEEP_MODE  (0x11)
#define MIPI_SET_DISPLEY_OFF  (0x28)
#define MIPI_SET_DISPLEY_ON   (0x29)
#define AXI_BURST_LENGTH      (128U)

static void cy_gfxss_update_display_rect_params(viv_display_size_type display_size, viv_dc_rect *dc_rect);
static uint8_t cy_gfxss_get_bpp_from_format(viv_input_format_type        format);
static vivSTATUS cy_gfxss_dc_init(GFXSS_Type *base, cy_stc_gfx_dc_config_t *config, cy_stc_mipidsi_config_t *mipi_dsi_cfg);


static void cy_gfxss_update_display_rect_params(viv_display_size_type display_size, viv_dc_rect *dc_rect)
{

    dc_rect->x = 0;
    dc_rect->y = 0;

    switch(display_size)
    {
        case vivDISPLAY_320_480_60:
            dc_rect->w = 320;
            dc_rect->h = 480;
            break;
    
        case vivDISPLAY_480_800_60:
            dc_rect->w = 480;
            dc_rect->h = 800;
            break;
    
        case vivDISPLAY_480_864_60:
            dc_rect->w = 480;
            dc_rect->h = 864;
            break;
    
        case vivDISPLAY_640_480_60:
            dc_rect->w = 640;
            dc_rect->h = 480;
            break;
    
        case vivDISPLAY_720_480_60:
            dc_rect->w = 720;
            dc_rect->h = 480;
            break;
    
        case vivDISPLAY_800_480_60:
            dc_rect->w = 800;
            dc_rect->h = 480;
            break;
    
        case vivDISPLAY_1024_600_60:
            dc_rect->w = 1024;
            dc_rect->h = 600;
            break;
    
        case vivDISPLAY_1024_768_60:
            dc_rect->w = 1024;
            dc_rect->h = 768;
            break;
    
        case vivDISPLAY_1280_720_60:
            dc_rect->w = 1280;
            dc_rect->h = 720;
            break;
    
        case vivDISPLAY_1920_1080_60:
            dc_rect->w = 1920;
            dc_rect->h = 1080;
            break;
    
        default:
            dc_rect->w = 0;
            dc_rect->h = 0;
        }
}

/** Get number of bits per pixel from the given display format */
static uint8_t cy_gfxss_get_bpp_from_format(viv_input_format_type format)
{
    uint8_t bpp = 0;

    switch(format)
    {
      case vivNV12:
      case vivNV16:
      case vivNV21:
          {
              bpp = 8;
          }
      break;
      case vivARGB4444:
      case vivABGR4444:
      case vivRGBA4444:
      case vivBGRA4444:
      case vivXRGB4444:
      case vivXBGR4444:
      case vivRGBX4444:
      case vivBGRX4444:
      case vivARGB1555:
      case vivABGR1555:
      case vivRGBA1555:
      case vivBGRA1555:
      case vivXRGB1555:
      case vivXBGR1555:
      case vivRGBX1555:
      case vivBGRX1555:
      case vivRGB565:
      case vivBGR565:
      case vivUYVY:
      case vivYUY2:
      case vivYV12:
      case vivYU12:

           {
               bpp = 16;
           }
           break;
      case vivARGB8888:
      case vivABGR8888:
      case vivRGBA8888:
      case vivBGRA8888:
      case vivXRGB8888:
      case vivXBGR8888:
      case vivRGBX8888:
      case vivBGRX8888:
      case vivARGB2101010:
           {
               bpp = 32;
           }
           break;
      default:
           {
               bpp = 0;
           }

    }

    return bpp;
}

static uint32_t cy_gfxss_configure_layer(cy_stc_gfx_layer_config_t *layer_config)
{
    gctUINT bpp = 0, stride = 0;
    viv_dc_buffer buffer = {0};
    uint32_t ret = 0;
    viv_dc_rect display_rect = {0};
 
    /* select layer */
    viv_dc_select_layer(layer_config->layer_type);
 
    /* enable layer if visibility is true*/
    if (layer_config->visibility)
    {
        viv_layer_enable(vivTRUE);
    } 
    bpp = cy_gfxss_get_bpp_from_format(layer_config->input_format_type);
 
    stride = layer_config->width * bpp / 8;
    if ((stride % AXI_BURST_LENGTH) != 0U)
    {
        stride = AXI_BURST_LENGTH * ((stride / AXI_BURST_LENGTH) + 1U);
    }
 
    /* config the buffer's phyAddr/format/tilemode/bufferWidth/bufferHeight/stride to kernel */
    buffer.phyAddress[0] = (gctADDRESS) layer_config->buffer_address;
    buffer.stride[0] = stride;
    if ((layer_config->input_format_type == vivNV12) || (layer_config->input_format_type == vivYUY2))
    {
        buffer.phyAddress[1] = (gctADDRESS) layer_config->uv_buffer_address;
        buffer.stride[1] = stride;
    }
    buffer.format = layer_config->input_format_type;
    buffer.tiling = layer_config->tiling_type;
    buffer.width = layer_config->width;
    buffer.height = layer_config->height;
    viv_layer_set(&buffer);

    /* config display region on panel */
    display_rect.x = 0;
    display_rect.y = 0;
    display_rect.w = layer_config->width;
    display_rect.h = layer_config->height;

    viv_layer_scale(&display_rect, vivFILTER_H3_V3);

