legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
    viv_layer_set_position(layer_config->pos_x, layer_config->pos_y);
 
    viv_layer_zorder(layer_config->zorder);

    viv_layer_poterduff_blend(vivTRUE, vivPD_SRC_OVER);
 
    viv_layer_set_display(vivDISPLAY_0);
 
    return ret;
}
/** Display controller initialization */
static vivSTATUS cy_gfxss_dc_init(GFXSS_Type *base, cy_stc_gfx_dc_config_t *config, cy_stc_mipidsi_config_t *mipi_dsi_cfg)
{
    vivSTATUS ret = vivSTATUS_OK;
    viv_dc_rect display_rect;
    viv_output display_output;

    memset(&display_rect, 0, sizeof(viv_dc_rect));
    memset(&display_output, 0, sizeof(viv_output));

    (void)base;

    /* open device */
    ret = viv_dc_init();

    if(ret)
        return ret;

    /* reset DC */
    viv_dc_reset();

    if ((config->display_type == GFX_DISP_TYPE_DPI) || (config->display_type == GFX_DISP_TYPE_DSI_DPI))
    {
        viv_conf_display_set_custom_size(dcCore, vivDISPLAY_0,
        mipi_dsi_cfg->display_params->hdisplay,
        mipi_dsi_cfg->display_params->hdisplay + mipi_dsi_cfg->display_params->hfp,
        mipi_dsi_cfg->display_params->hdisplay + mipi_dsi_cfg->display_params->hfp + mipi_dsi_cfg->display_params->hsync_width,
        mipi_dsi_cfg->display_params->hdisplay + mipi_dsi_cfg->display_params->hfp + mipi_dsi_cfg->display_params->hsync_width + mipi_dsi_cfg->display_params->hbp,
        mipi_dsi_cfg->display_params->vdisplay,
        mipi_dsi_cfg->display_params->vdisplay + mipi_dsi_cfg->display_params->vfp,
        mipi_dsi_cfg->display_params->vdisplay + mipi_dsi_cfg->display_params->vfp + mipi_dsi_cfg->display_params->vsync_width,
        mipi_dsi_cfg->display_params->vdisplay + mipi_dsi_cfg->display_params->vfp + mipi_dsi_cfg->display_params->vsync_width + mipi_dsi_cfg->display_params->vbp
        );
    }
    else
    {
        viv_conf_display_set_custom_size(dcCore, vivDISPLAY_0,
        mipi_dsi_cfg->display_params->hdisplay,
        0,
        mipi_dsi_cfg->display_params->hdisplay,
        mipi_dsi_cfg->display_params->hdisplay,
        mipi_dsi_cfg->display_params->vdisplay,
        0,
        mipi_dsi_cfg->display_params->vdisplay,
        mipi_dsi_cfg->display_params->vdisplay
        );
    }

    /* Configure Graphics/Video Layer */
    if(config->gfx_layer_config != NULL && config->gfx_layer_config->layer_enable )
    {
        cy_gfxss_configure_layer(config->gfx_layer_config);
    }

    /* Configure Overlay 0 Layer */
    if(config->ovl0_layer_config != NULL && config->ovl0_layer_config->layer_enable )
    {
        cy_gfxss_configure_layer(config->ovl0_layer_config);
    }

    /* Configure Overlay 1 Layer */
    if(config->ovl1_layer_config != NULL && config->ovl1_layer_config->layer_enable )
    {
        /* Check if Overlay 1 is using YUV format and unsupported tiling type */
    if ((config->ovl1_layer_config->input_format_type >= vivYUY2 && config->ovl1_layer_config->input_format_type <= vivNV21) 
            || config->ovl1_layer_config->tiling_type != vivLINEAR )
        {
            return vivSTATUS_NOT_SUPPORT;
        }
    
        cy_gfxss_configure_layer(config->ovl1_layer_config);
    }


    /* Get display size from viv_display_size_type */
    cy_gfxss_update_display_rect_params(config->display_size, &display_rect);

    viv_set_display_size(vivDISPLAY_0, config->display_size);

    display_output.format = config->display_format;

    if ((config->display_type == GFX_DISP_TYPE_DPI) || (config->display_type == GFX_DISP_TYPE_DSI_DPI))
    {
        display_output.type = vivDPI;
        viv_set_output(vivDISPLAY_0, &display_output, vivTRUE);
    }
    else
    {
        display_output.type = vivDBI;
        
        if(config->display_type == GFX_DISP_TYPE_DSI_DBI)
        {
            viv_set_output_dbi(vivDISPLAY_0, vivDBI_B);
        }
        else
        {
            viv_set_output_dbi(vivDISPLAY_0, (viv_dbi_type)config->display_type);
        }
        viv_set_output(vivDISPLAY_0, &display_output, vivTRUE);    
        viv_set_commit(1);
    }


    return ret;
}

cy_en_gfx_status_t Cy_GFXSS_Init(GFXSS_Type *base, cy_stc_gfx_config_t *config, cy_stc_gfx_context_t *context)
{

/* Configures:-

 - Clock and power
 - Enable IP Block
 - Call vg_lite_init() and vg_lite_allocate() with video/graphics layer resolution.
 - Sets the user provided interrupt mask setting.  */
    CY_ASSERT(base != NULL);
    CY_ASSERT(config != NULL);
    CY_ASSERT(context != NULL);

    uint32_t frac_divider;
    cy_en_gfx_status_t result = CY_GFX_SUCCESS;
    GFXSS_GPU_Type *gpu_base = &(base->GFXSS_GPU);
    GFXSS_DC_Type *dc_base = &(base->GFXSS_DC);
    GFXSS_MIPIDSI_Type *mipidsi_base = &(base->GFXSS_MIPIDSI);

    cy_stc_gfx_dc_config_t *dc_cfg = config->dc_cfg;
    cy_stc_mipidsi_config_t *mipi_dsi_cfg = config->mipi_dsi_cfg;

    /* Assume Clock and Power are already available by this moment */

    /* Enable GPU if user provided configuration */
    if (gpu_base != NULL && (config->gpu_cfg->enable))
    {
        gpu_base->MXGPU.CTL |= GFXSS_GPU_MXGPU_CTL_ENABLED_Msk;
        context->gpu_context.enabled = true;
    }

    /* Configure MIPI DSI */
    if (((config->dc_cfg->display_type == GFX_DISP_TYPE_DSI_DBI) ||
         (config->dc_cfg->display_type == GFX_DISP_TYPE_DSI_DPI)) &&
        (mipi_dsi_cfg != NULL) && (mipidsi_base != NULL) && (result == CY_GFX_SUCCESS))
    {
        /* DSI specific Configuration */
        mipidsi_base->MXMIPIDSI.CLK_CTL |= GFXSS_MIPIDSI_MXMIPIDSI_CLK_CTL_CLK_CFG_Msk;
        mipidsi_base->MXMIPIDSI.CTL |= GFXSS_MIPIDSI_MXMIPIDSI_CTL_ENABLED_Msk;
        mipidsi_base->MXMIPIDSI.PHY_FREQ_RANGE = _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_PHY_FREQ_RANGE_CFG_CLK_FREQ_RANGE, (((CLK_SYS_FREQ / 2)   - 17U) * 4U));
        mipidsi_base->MXMIPIDSI.INTR_MASK = _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_CORE_MASK, 1U) | _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DBI_TE_MASK, 1U) | _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DPI_HALT_MASK, 1U);

        if (config->dc_cfg->display_type == GFX_DISP_TYPE_DSI_DPI)
        {
            mipidsi_base->MXMIPIDSI.DBI_CMD = 1;
        }
        else
        {
            mipidsi_base->MXMIPIDSI.DPI_CMD = 1; /* Default Polarity */
        }

