legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
        if (Cy_MIPIDSI_Init(mipidsi_base, mipi_dsi_cfg, &context->mipidsi_context) != CY_MIPIDSI_SUCCESS)
        {
            result = CY_GFX_BAD_PARAM;
        }
        
        context->clockHz = config->clockHz;
        context->mipidsi_context.virtual_ch = mipi_dsi_cfg->virtual_ch;             /**< Display controller configuration */
        context->mipidsi_context.num_of_lanes = mipi_dsi_cfg->num_of_lanes;           /**< GPU configuration is optional */
        context->mipidsi_context.per_lane_mbps = mipi_dsi_cfg->per_lane_mbps;          /**< per lane speed in mbps */
        context->mipidsi_context.dpi_fmt = mipi_dsi_cfg->dpi_fmt;                /**< MIPI DSI configuration */
        context->mipidsi_context.max_phy_clk = mipi_dsi_cfg->max_phy_clk;            /**< device max DPHY clock in MHz unit */
        context->mipidsi_context.dsi_mode = mipi_dsi_cfg->dsi_mode;               /**< Command mode/Video mode */
        context->mipidsi_context.mode_flags = mipi_dsi_cfg->mode_flags;             /**< Additional mode information */
        context->mipidsi_context.enable = true;
        
        memcpy(&context->mipidsi_context.display_params, mipi_dsi_cfg->display_params, sizeof(cy_stc_mipidsi_display_params_t));        /**< Display parameters */   
    }else{
         context->mipidsi_context.enable = false;
    }

    /* Configure Display Controller */
       if (dc_base != NULL)
       {
           frac_divider = (uint32_t)(((float)(config->clockHz / 1000U) / mipi_dsi_cfg->display_params->pixel_clock) * BIT(16));   //Getting fractional divider value for pixel clock in fixed point representation.
           frac_divider < 0x20000 ? frac_divider = 0x20000 : frac_divider; //Minimum value of fractional divider is 2.
           dc_base->MXDC.CLK_CTL = _VAL2FLD(GFXSS_DC_MXDC_CLK_CTL_CLK_DIV, frac_divider) | GFXSS_DC_MXDC_CLK_CTL_CLK_CORE_Msk;
           dc_base->MXDC.CTL |= GFXSS_DC_MXDC_CTL_ENABLED_Msk;
           dc_base->MXDC.INTR_MASK |= _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_CORE_MASK, 1U) | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR0_MASK, 1U)
                                   | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR1_MASK, 1U) | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR2_MASK, 1U)
                                   | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR3_MASK, 1U) | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_RLAD_ERROR_MASK, 1U);

           switch(config->dc_cfg->display_type)
           {
               case GFX_DISP_TYPE_DPI:
               {
                   dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_DPI_ENABLED_Msk;
               }
               break;
               case GFX_DISP_TYPE_DBI_A:
               case GFX_DISP_TYPE_DBI_B:
               case GFX_DISP_TYPE_DBI_C:
               {
                    dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_DBI_ENABLED_Msk;

                    /* SPI Interface */
                    if (config->dc_cfg->display_type == GFX_DISP_TYPE_DBI_C)
                    {
                        dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_SPI_ENABLED_Msk;
                    }
               }
               break;
               case GFX_DISP_TYPE_DSI_DBI:
               case GFX_DISP_TYPE_DSI_DPI:
               {
                   if(mipidsi_base == NULL)
                   {
                       return CY_GFX_BAD_PARAM;
                   }

                   dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_DPI_ENABLED_Msk;
               }

               break;
               default:
               {
                    /* Unsupported Display type */
               }
           }

           if (cy_gfxss_dc_init(base,dc_cfg,mipi_dsi_cfg) != 0U)
           {
               result = CY_GFX_BAD_PARAM;
           }else
           {
               if(dc_cfg->gfx_layer_config == NULL) {
                   context->dc_context.gfx_layer_config.layer_enable = false;
               }else
               {
                   memcpy(&context->dc_context.gfx_layer_config, dc_cfg->gfx_layer_config, sizeof(cy_stc_gfx_layer_config_t));
               }
               if(dc_cfg->ovl0_layer_config == NULL) {
                   context->dc_context.ovl0_layer_config.layer_enable = false;
               }else
               {
                   memcpy(&context->dc_context.ovl0_layer_config, dc_cfg->ovl0_layer_config, sizeof(cy_stc_gfx_layer_config_t));
               }
               if(dc_cfg->ovl1_layer_config == NULL) {
                   context->dc_context.ovl1_layer_config.layer_enable = false;
               }else
               {
                   memcpy(&context->dc_context.ovl1_layer_config, dc_cfg->ovl1_layer_config, sizeof(cy_stc_gfx_layer_config_t));
               }
               if(dc_cfg->rlad_config == NULL) {
                   context->dc_context.rlad_config.enable = false;
               }else
               {
                   memcpy(&context->dc_context.rlad_config, dc_cfg->rlad_config, sizeof(cy_stc_gfx_rlad_cfg_t));
                   Cy_GFXSS_RLAD_SetImage(base, dc_cfg->rlad_config, context);
                   if(context->dc_context.rlad_config.enable == 1U){
                       Cy_GFXSS_RLAD_Enable(base, context);
                   }
               }
               if(dc_cfg->cursor_config == NULL) {
                   context->dc_context.cursor_config.enable = false;
               }else
               {
                   memcpy(&context->dc_context.cursor_config, dc_cfg->cursor_config, sizeof(cy_stc_gfx_cursor_config_t));
               }
               context->dc_context.display_type = dc_cfg->display_type;
               context->dc_context.display_format = dc_cfg->display_format;
               context->dc_context.display_size = dc_cfg->display_size;
               context->dc_context.display_width = dc_cfg->display_width;
               context->dc_context.display_height = dc_cfg->display_height;
               context->dc_context.interrupt_mask = dc_cfg->interrupt_mask;
           }

       }


    return result;

}

cy_en_gfx_status_t  Cy_GFXSS_SleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    /* 
     * No action required for sleep mode.
     * The graphics subsystem is an active component and does not retain state across sleep.
     * No context save/restore is needed before or after sleep transitions.
     */
    (void)callbackParams;
    (void)mode;
    return CY_GFX_SUCCESS;
}

cy_en_syspm_status_t  Cy_GFXSS_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{

    cy_en_syspm_status_t retStatus = CY_SYSPM_SUCCESS;
    
    CY_ASSERT_L1(NULL != callbackParams);
    
    int32_t ts_width, ts_height, intr_mask;
    GFXSS_Type *locBase = (GFXSS_Type *) callbackParams->base;
    cy_stc_gfx_context_t *locContext = (cy_stc_gfx_context_t *) callbackParams->context;

    GFXSS_GPU_Type *gpu_base = &(locBase->GFXSS_GPU);
    GFXSS_DC_Type *dc_base = &(locBase->GFXSS_DC);
    GFXSS_MIPIDSI_Type *mipidsi_base = &(locBase->GFXSS_MIPIDSI);

    switch(mode)
    {
        case CY_SYSPM_CHECK_READY:
        {
        	bool checkFail = false;
            intr_mask = dc_base->MXDC.INTR_MASK;
            dc_base->MXDC.INTR_MASK = 0U;
            if(locContext->gpu_context.enabled)
            {
                checkFail = (gpu_base->GCNANO.AQHIIDLE & GPU_IDLE_MASK ) != GPU_IDLE_MASK;
            }
            if (checkFail)
            {
                dc_base->MXDC.INTR_MASK = intr_mask;
                retStatus = CY_SYSPM_FAIL;
            }
            else
            {
                retStatus = CY_SYSPM_SUCCESS;
            }
        }
        break;

        case CY_SYSPM_CHECK_FAIL:
        {
            retStatus = CY_SYSPM_SUCCESS;
        }
        break;
        case CY_SYSPM_AFTER_TRANSITION:
        {
            /* Enable GPU if user provided configuration */
            if(locContext->gpu_context.enabled)
            {
                gpu_base->MXGPU.CTL |= GFXSS_GPU_MXGPU_CTL_ENABLED_Msk;
            }
            
            /* Configure Display Controller */
            uint32_t frac_divider = (uint32_t)(((float)(locContext->clockHz / 1000U) / locContext->mipidsi_context.display_params.pixel_clock) * BIT(16));   //Getting fractional divider value for pixel clock in fixed point representation.
            frac_divider < 0x20000 ? frac_divider = 0x20000 : frac_divider; //Minimum value of fractional divider is 2.
            dc_base->MXDC.CLK_CTL = _VAL2FLD(GFXSS_DC_MXDC_CLK_CTL_CLK_DIV, frac_divider) | GFXSS_DC_MXDC_CLK_CTL_CLK_CORE_Msk;
            dc_base->MXDC.CTL |= GFXSS_DC_MXDC_CTL_ENABLED_Msk;
            
