legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
            dc_base->MXDC.INTR_MASK |= _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_CORE_MASK, 1U) | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR0_MASK, 1U)
                                    | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR1_MASK, 1U) | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR2_MASK, 1U)
                                    | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_ADDR3_MASK, 1U) | _VAL2FLD(GFXSS_DC_MXDC_INTR_MASK_RLAD_ERROR_MASK, 1U);

            switch(locContext->dc_context.display_type)
            {
                case GFX_DISP_TYPE_DPI:
                {
                    dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_DPI_ENABLED_Msk;
                }
                break;
                case GFX_DISP_TYPE_DBI_A:
                case GFX_DISP_TYPE_DBI_B:
                case GFX_DISP_TYPE_DBI_C:
                {
                    dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_DBI_ENABLED_Msk;
                    /* SPI Interface */
                    if (locContext->dc_context.display_type == GFX_DISP_TYPE_DBI_C)
                    {
                        dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_SPI_ENABLED_Msk;
                    }
                }
                break;
                case GFX_DISP_TYPE_DSI_DBI:
                case GFX_DISP_TYPE_DSI_DPI:
                {
                    if(mipidsi_base == NULL)
                    {
                        retStatus = CY_SYSPM_FAIL;
                    }

                    dc_base->MXDC.IO_CTL |= GFXSS_DC_MXDC_IO_CTL_DPI_ENABLED_Msk;

                    /* DSI specific Configuration */
                    mipidsi_base->MXMIPIDSI.CLK_CTL |= GFXSS_MIPIDSI_MXMIPIDSI_CLK_CTL_CLK_CFG_Msk;
                    mipidsi_base->MXMIPIDSI.CTL |= GFXSS_MIPIDSI_MXMIPIDSI_CTL_ENABLED_Msk;
                    mipidsi_base->MXMIPIDSI.PHY_FREQ_RANGE = _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_PHY_FREQ_RANGE_CFG_CLK_FREQ_RANGE, (((CLK_SYS_FREQ / 2)   - 17U) * 4U));
                    mipidsi_base->MXMIPIDSI.INTR_MASK = _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_CORE_MASK, 1U) | _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DBI_TE_MASK, 1U) | _VAL2FLD(GFXSS_MIPIDSI_MXMIPIDSI_INTR_MASK_DPI_HALT_MASK, 1U);

                    if (locContext->dc_context.display_type == GFX_DISP_TYPE_DSI_DPI)
                    {
                        mipidsi_base->MXMIPIDSI.DBI_CMD = 1;
                    }
                    else
                    {
                        mipidsi_base->MXMIPIDSI.DPI_CMD = 1; /* Default Polarity */
                    }
                }

                break;
            }

            cy_stc_gfx_dc_config_t dccfg;
            cy_stc_mipidsi_config_t dsicfg;

            if(locContext->dc_context.gfx_layer_config.layer_enable==false){
                dccfg.gfx_layer_config = NULL;
            }else{
                dccfg.gfx_layer_config = &locContext->dc_context.gfx_layer_config;
            }
            if(locContext->dc_context.ovl0_layer_config.layer_enable==false){
                dccfg.ovl0_layer_config = NULL;
            }else{
                dccfg.ovl0_layer_config = &locContext->dc_context.ovl0_layer_config;
            }
            if(locContext->dc_context.ovl1_layer_config.layer_enable==false){
                dccfg.ovl1_layer_config = NULL;
            }else{
                dccfg.ovl1_layer_config = &locContext->dc_context.ovl1_layer_config;
            }
            if(locContext->dc_context.rlad_config.enable==false){
                dccfg.rlad_config = NULL;
            }else{
                dccfg.rlad_config = &locContext->dc_context.rlad_config;
            }
            if(locContext->dc_context.cursor_config.enable==false){
                dccfg.cursor_config = NULL;
            }else{
                dccfg.cursor_config = &locContext->dc_context.cursor_config;
            }
            dccfg.display_type = locContext->dc_context.display_type;         
            dccfg.display_format = locContext->dc_context.display_format;        
            dccfg.display_size = locContext->dc_context.display_size;        
            dccfg.display_width = locContext->dc_context.display_width;        
            dccfg.display_height = locContext->dc_context.display_height;      
            dccfg.interrupt_mask = locContext->dc_context.interrupt_mask;   

            /* Configure MIPI DSI */
            if(locContext->mipidsi_context.enable != false){
                dsicfg.virtual_ch = locContext->mipidsi_context.virtual_ch;
                dsicfg.num_of_lanes = locContext->mipidsi_context.num_of_lanes;
                dsicfg.per_lane_mbps = locContext->mipidsi_context.per_lane_mbps;
                dsicfg.dpi_fmt = locContext->mipidsi_context.dpi_fmt;
                dsicfg.max_phy_clk = locContext->mipidsi_context.max_phy_clk;
                dsicfg.dsi_mode = locContext->mipidsi_context.dsi_mode;
                dsicfg.mode_flags = locContext->mipidsi_context.mode_flags;
                dsicfg.display_params = &locContext->mipidsi_context.display_params;  
                Cy_MIPIDSI_Init(mipidsi_base, &dsicfg, &locContext->mipidsi_context);
            }
            cy_gfxss_dc_init(locBase, &dccfg, &dsicfg);
  
            if(dccfg.rlad_config != NULL) 
            {
                Cy_GFXSS_RLAD_SetImage(locBase, dccfg.rlad_config, locContext);
                if(locContext->dc_context.rlad_config.enable){
                    Cy_GFXSS_RLAD_Enable(locBase, locContext);
                }
            }

            if(locContext->dc_context.gfx_layer_config.layer_enable){
                if ((locContext->dc_context.gfx_layer_config.input_format_type == vivNV12) || (locContext->dc_context.gfx_layer_config.input_format_type == vivYUY2))
                {
                    Cy_GFXSS_Set_FrameBuffer_YUV(locBase, (uint32_t *)(locContext->dc_context.gfx_layer_config.buffer_address), (uint32_t *)(locContext->dc_context.gfx_layer_config.uv_buffer_address), locContext);
                }
                else
                {
                    Cy_GFXSS_Set_FrameBuffer(locBase, (uint32_t *)(locContext->dc_context.gfx_layer_config.buffer_address), locContext);
                }
            }
            if(locContext->dc_context.ovl0_layer_config.layer_enable){
                if ((locContext->dc_context.gfx_layer_config.input_format_type == vivNV12) || (locContext->dc_context.gfx_layer_config.input_format_type == vivYUY2))
                {
                    Cy_GFXSS_Set_Overlay0_YUV(locBase, (uint32_t *)(locContext->dc_context.ovl0_layer_config.buffer_address), (uint32_t *)(locContext->dc_context.ovl0_layer_config.uv_buffer_address), locContext);
                }
                else
                {
                    Cy_GFXSS_Set_Overlay0(locBase, (uint32_t *)(locContext->dc_context.ovl0_layer_config.buffer_address), locContext);
                }
            }
            if(locContext->dc_context.ovl1_layer_config.layer_enable){
            	Cy_GFXSS_Set_Overlay1(locBase, (uint32_t *)(locContext->dc_context.ovl1_layer_config.buffer_address), locContext);
            }
            if(locContext->gpu_context.enabled && locContext->gpu_context.vg_lite_initialised){
                vg_lite_init(locContext->gpu_context.ts_width, locContext->gpu_context.ts_height);
            }

            retStatus = CY_SYSPM_SUCCESS;

