legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
        }
        break;

        case CY_SYSPM_BEFORE_TRANSITION:
        {
            if( vg_lite_get_tessellation_parameters( &ts_width, &ts_height) == VG_LITE_SUCCESS){
                locContext->gpu_context.vg_lite_initialised = true;
                locContext->gpu_context.ts_width = (uint32_t)ts_width;
                locContext->gpu_context.ts_height = (uint32_t)ts_height;
                vg_lite_close();
            }else{
                locContext->gpu_context.vg_lite_initialised = false;
            }

            viv_dc_deinit();

            retStatus = CY_SYSPM_SUCCESS;
        }
        break;

        default:
            retStatus = CY_SYSPM_FAIL;
            break;
    }

    return (retStatus);
}

void Cy_GFXSS_Clear_DC_Interrupt(GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
  CY_ASSERT(base != NULL);
  CY_ASSERT(context != NULL);
  
  GFXSS_DC_Type *dc_base = &(base->GFXSS_DC);

  /* DC */
  if (dc_base != NULL)
  {
      (void)(dc_base->DCNANO.GCREGDISPLAYINTR);
      dc_base->MXDC.INTR = CLEAR_INTERRUPT;
  }
}

void Cy_GFXSS_Clear_GPU_Interrupt(GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
  CY_ASSERT(base != NULL);
  CY_ASSERT(context != NULL);
 
  GFXSS_GPU_Type *gpu_base = &(base->GFXSS_GPU);

  if (gpu_base != NULL)
  {
      gpu_base->MXGPU.INTR = CLEAR_INTERRUPT;
  }
}


void  Cy_GFXSS_Interrupt(GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
  CY_ASSERT(base != NULL);
  CY_ASSERT(context != NULL);
  
  GFXSS_GPU_Type *gpu_base = &(base->GFXSS_GPU);
  GFXSS_DC_Type *dc_base = &(base->GFXSS_DC);
  GFXSS_MIPIDSI_Type *mipidsi_base = &(base->GFXSS_MIPIDSI);

  /* Clear interrupts */

  /* GPU */
  if (gpu_base != NULL)
  {
      gpu_base->MXGPU.INTR = CLEAR_INTERRUPT;
  }

  /* DC */
  if (dc_base != NULL)
  {
      dc_base->MXDC.INTR = CLEAR_INTERRUPT;
  }

  /* MIPI DSI */
  if (mipidsi_base != NULL)
  {
      mipidsi_base->MXMIPIDSI.INTR = CLEAR_INTERRUPT;
  }
}

cy_en_gfx_status_t Cy_GFXSS_Set_FrameBuffer(GFXSS_Type *base, uint32_t* gfx_layer_buffer, cy_stc_gfx_context_t *context)
{

    CY_ASSERT(base != NULL);
    
    if (gfx_layer_buffer != NULL)
    {
        base->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERADDRESS = (uint32_t)gfx_layer_buffer;
        context->dc_context.gfx_layer_config.buffer_address = (gctADDRESS *)gfx_layer_buffer;
        viv_set_commit(0x1);

        return CY_GFX_SUCCESS;
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }
}

cy_en_gfx_status_t Cy_GFXSS_Set_FrameBuffer_YUV(GFXSS_Type *base, uint32_t* y_buffer, uint32_t* uv_buffer, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);

    if ((y_buffer != NULL) && (uv_buffer != NULL))
    {
        base->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERADDRESS = (uint32_t)y_buffer;
        base->GFXSS_DC.DCNANO.GCREGDCTILEUVFRAMEBUFFERADR = (uint32_t)uv_buffer;
        context->dc_context.gfx_layer_config.buffer_address = (gctADDRESS *)y_buffer;
        context->dc_context.gfx_layer_config.uv_buffer_address = (gctADDRESS *)uv_buffer;

        viv_set_commit(0x1);

        return CY_GFX_SUCCESS;
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }
}

cy_en_gfx_status_t Cy_GFXSS_Set_Overlay0(GFXSS_Type *base, uint32_t* overlay0_buffer, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);

    if (overlay0_buffer != NULL)
    {
        base->GFXSS_DC.DCNANO.GCREGOVERLAYADDRESS = (uint32_t)overlay0_buffer;
        context->dc_context.ovl0_layer_config.buffer_address = (gctADDRESS *)overlay0_buffer;
        viv_set_commit(0x1);
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }

    return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_Set_Overlay0_YUV(GFXSS_Type *base, uint32_t* y_buffer, uint32_t* uv_buffer, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);

    if ((y_buffer != NULL) && (uv_buffer != NULL))
    {
        base->GFXSS_DC.DCNANO.GCREGOVERLAYADDRESS = (uint32_t)y_buffer;
        base->GFXSS_DC.DCNANO.GCREGDCTILEUVOVERLAYADR = (uint32_t)uv_buffer;
        context->dc_context.ovl0_layer_config.buffer_address = (gctADDRESS *)y_buffer;
        context->dc_context.ovl0_layer_config.uv_buffer_address = (gctADDRESS *)uv_buffer;
        viv_set_commit(0x1);

    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }

    return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_Set_Overlay1(GFXSS_Type *base, uint32_t* overlay1_buffer, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);

    if (overlay1_buffer != NULL)
    {
        base->GFXSS_DC.DCNANO.GCREGOVERLAYADDRESS1 = (uint32_t)overlay1_buffer; 
        context->dc_context.ovl1_layer_config.buffer_address = (gctADDRESS *)overlay1_buffer;
        viv_set_commit(0x1);

    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }
    
    return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_Set_Layer_Enabled(GFXSS_Type *base, cy_en_gfx_layer_type_t layer_id, bool enable)
{
    CY_ASSERT(base != NULL);
    switch(layer_id)
    {
        case GFX_LAYER_GRAPHICS:
            if(enable)
            {
                base->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERCONFIG |= GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_ENABLE_Msk;
            }
            else
            {
                base->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERCONFIG &= ~GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_ENABLE_Msk;
            }
            break;
    
        case GFX_LAYER_OVERLAY0:
            if (enable)
            {
                base->GFXSS_DC.DCNANO.GCREGOVERLAYCONFIG |= GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_ENABLE_Msk;
            }
            else
            {
                base->GFXSS_DC.DCNANO.GCREGOVERLAYCONFIG &= ~GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_ENABLE_Msk;
            }
            break;
        case GFX_LAYER_OVERLAY1:
            if (enable)
            {
                base->GFXSS_DC.DCNANO.GCREGOVERLAYCONFIG1 |= GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_ENABLE_Msk;
            }
            else
            {
                base->GFXSS_DC.DCNANO.GCREGOVERLAYCONFIG1 &= ~GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_ENABLE_Msk;
            }
            break;
        default:
            return CY_GFX_BAD_PARAM; 
    }
    viv_set_commit(0x1);
    return CY_GFX_SUCCESS;
}

uint32_t* Cy_GFXSS_Get_FrameBufferAddress(GFXSS_Type *base)
{
    CY_ASSERT(base != NULL);

    return (uint32_t *)(base->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERADDRESS);

