legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
}

cy_en_gfx_status_t Cy_GFXSS_DeInit(GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);
    CY_ASSERT(context != NULL);

    GFXSS_GPU_Type *gpu_base = &(base->GFXSS_GPU);
    GFXSS_DC_Type *dc_base = &(base->GFXSS_DC);
    GFXSS_MIPIDSI_Type *mipidsi_base = &(base->GFXSS_MIPIDSI);

    /* Disable GPU */
    if (gpu_base != NULL && context->gpu_context.enabled)
    {
        gpu_base->MXGPU.CTL &= ~GFXSS_GPU_MXGPU_CTL_ENABLED_Msk;
        context->gpu_context.enabled = false;
    }

    /* Disable DC */
    if (dc_base != NULL)
    {
        if(context->dc_context.gfx_layer_config.layer_enable){
            viv_dc_select_layer(context->dc_context.gfx_layer_config.layer_type);
            viv_layer_enable(vivFALSE);
            viv_set_commit(0x1);
        }
        if(context->dc_context.ovl0_layer_config.layer_enable){
            viv_dc_select_layer(context->dc_context.ovl0_layer_config.layer_type);
            viv_layer_enable(vivFALSE);
            viv_set_commit(0x1);
        }
        if(context->dc_context.ovl1_layer_config.layer_enable){
            viv_dc_select_layer(context->dc_context.ovl1_layer_config.layer_type);
            viv_layer_enable(vivFALSE);
            viv_set_commit(0x1);
        }

        viv_dc_deinit();
        dc_base->MXDC.CTL &= ~GFXSS_DC_MXDC_CTL_ENABLED_Msk;
    }

    /* MIPI DSI Base */
    if (mipidsi_base != NULL)
    {
        Cy_MIPIDSI_DeInit(mipidsi_base);
        Cy_MIPIDSI_Disable(mipidsi_base);
    }

    return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_RLAD_SetImage(GFXSS_Type *base, cy_stc_gfx_rlad_cfg_t *rlad_cfg, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);
    CY_ASSERT(rlad_cfg != NULL);
    GFXSS_DC_Type *gfxss_dc = &(base->GFXSS_DC);

    if(gfxss_dc !=NULL)
    {
        context->dc_context.rlad_config = *rlad_cfg;
        /* Update Layer ID and Disable RLAD by default */
        gfxss_dc->MXDC.RLAD_CTL = _VAL2FLD(GFXSS_DC_MXDC_RLAD_CTL_RLAD_LAYER, rlad_cfg->layer_id + 1U);

        /* Image properties */
        gfxss_dc->MXDC.RLAD_IMG = (_VAL2FLD(GFXSS_DC_MXDC_RLAD_IMG_RLAD_WIDTH, rlad_cfg->image_width) |
                                    _VAL2FLD(GFXSS_DC_MXDC_RLAD_IMG_RLAD_HEIGHT, rlad_cfg->image_height) |
                                    _VAL2FLD(GFXSS_DC_MXDC_RLAD_IMG_RLAD_FORMAT, rlad_cfg->rlad_format));
        /* RLAD compression mode */
        gfxss_dc->MXDC.RLAD_ENC = _VAL2FLD(GFXSS_DC_MXDC_RLAD_ENC_RLAD_MODE, rlad_cfg->compression_mode);
        gfxss_dc->MXDC.RLAD_ENC |= _VAL2FLD(GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_R, 8U);
        gfxss_dc->MXDC.RLAD_ENC |= _VAL2FLD(GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_G, 8U);
        gfxss_dc->MXDC.RLAD_ENC |= _VAL2FLD(GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_B, 8U);
        gfxss_dc->MXDC.RLAD_ENC |= _VAL2FLD(GFXSS_DC_MXDC_RLAD_ENC_RLAD_BITS_A, 8U);

        /* Compressed Image address */
        gfxss_dc->MXDC.RLAD_BUF0 = (uint32_t)rlad_cfg->image_address;

        /* Compressed Image size */
        gfxss_dc->MXDC.RLAD_BUF1 = _VAL2FLD(GFXSS_DC_MXDC_RLAD_BUF1_RLAD_SIZE, rlad_cfg->compressed_image_size);

        return CY_GFX_SUCCESS;
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }
}

cy_en_gfx_status_t Cy_GFXSS_RLAD_Enable( GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);

    GFXSS_DC_Type *gfxss_dc = &(base->GFXSS_DC);

    if(gfxss_dc !=NULL)
    {
        gfxss_dc->MXDC.RLAD_CTL |= GFXSS_DC_MXDC_RLAD_CTL_RLAD_ENABLE_Msk;
        context->dc_context.rlad_config.enable = true;
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }
    return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_RLAD_Disable( GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);

    GFXSS_DC_Type *gfxss_dc = &(base->GFXSS_DC);

    if(gfxss_dc !=NULL)
    {
        gfxss_dc->MXDC.RLAD_CTL &= ~GFXSS_DC_MXDC_RLAD_CTL_RLAD_ENABLE_Msk;
        context->dc_context.rlad_config.enable = false;
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }

    return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_Transfer_Frame( GFXSS_Type *base, cy_stc_gfx_context_t *context){
    CY_ASSERT(base != NULL);
    CY_ASSERT(context != NULL);

    GFXSS_DC_Type *gfxss_dc = &(base->GFXSS_DC);
    GFXSS_MIPIDSI_Type *mipi_dsi_base = &(base->GFXSS_MIPIDSI);

    uint8_t packet_col_address[5], packet_row_address[5];
    uint32_t horizontal_resolution = context->dc_context.display_width;
    uint32_t vertical_resolution = context->dc_context.display_height;
    uint32_t No_of_lines = 0, i=0, j = 0, line_stride = 0, line_stride_overlay = 0, line_stride_overlay1 = 0;

    uint8_t bytes_per_pixel_framebuffer = RGB_16_BIT_PIXEL_FORMAT_IN_BYTES;    
    float bytes_per_pixel_dc_output = 0;
    uint8_t bytes_per_pixel_overlay = RGB_16_BIT_PIXEL_FORMAT_IN_BYTES;
    uint8_t bytes_per_pixel_overlay1 = RGB_16_BIT_PIXEL_FORMAT_IN_BYTES;
    uint32_t rtos_delay_us = 0;

    switch(context->dc_context.display_format)
    {
    case vivD8R3G3B2:
	case vivD16R3G3B2:
         bytes_per_pixel_dc_output = 1.0f;
         break;
    case vivD8R4G4B4:
    case vivD16R4G4B4:
         bytes_per_pixel_dc_output = 1.5f;
         break;
    case vivD8R5G6B5:
    case vivD16R5G6B5:
         bytes_per_pixel_dc_output = 2.0f;
         break;
    case vivD8R6G6B6:
    case vivD9R6G6B6:
    case vivD16R6G6B6OP1:
    case vivD16R6G6B6OP2:
         bytes_per_pixel_dc_output = 2.25f;
         break;
    case vivD8R8G8B8:
    case vivD16R8G8B8OP1:
    case vivD16R8G8B8OP2:
         bytes_per_pixel_dc_output = 3.0f;
         break;

    default:
         bytes_per_pixel_dc_output = 2.0f;
         break;
    }

    /*Dc_dbitypeab_div_int == dc_gcregdbiwrchar1_dbi_wr_period * (m_dc_gcregdbiconfig_dbi_ac_time_unit +1);
    500 Mbps per lane
    500/8 = 62.5 MHz lane byte clock
    max DBI clock should be 1/4th of lane byte clock = 15.625 MHz
    Divider value close to 15.625 MHz = 13 for 15.38 Mhz */
    uint32_t lane_byte_clock_KHz = (context->mipidsi_context.per_lane_mbps * 1000U) / 8U;  /* 500000/8 = 62500 KHz lane byte clock*/
    uint32_t dbi_clock_KHz = lane_byte_clock_KHz / 4U;                           /* Max DBI clock should be 1/4th of lane byte clock = 62500 / 4 = 15625 KHz*/
    uint32_t dsi_clock_KHz = context->clockHz / 2000U;                     /* DSI internal divider of 2 and conversion to KHz, dsi clock = (400000000 / 2) / 1000 MHz = 200000 KHz*/
    uint32_t divider = (dsi_clock_KHz + dbi_clock_KHz - 1) / dbi_clock_KHz;      /* ceil of divider value dsi_clock_KHz / dbi_clock_KHz = 200000 / 15625 = 13*/
    divider < 3 ? divider = 3 : divider;       /* minimum value for divider is 3*/
    dbi_clock_KHz = dsi_clock_KHz / divider;   /* calculate dbi clock value after divider */

