legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
    gfxss_dc->DCNANO.GCREGDBIWRCHAR1 &= ~GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_PERIOD_Msk;
    gfxss_dc->DCNANO.GCREGDBIWRCHAR1 |= _VAL2FLD(GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_PERIOD, divider);

    if ((context->dc_context.display_format == vivD16R8G8B8OP1) || (context->dc_context.display_format == vivD16R8G8B8OP2))
    {
        rtos_delay_us = ((DBI_SCLICE_LIMIT_IN_BYTES * 1000U / 2U) / dbi_clock_KHz) + 50U;
    }
    else
    {
        rtos_delay_us = ((DBI_SCLICE_LIMIT_IN_BYTES * 1000U )/ dbi_clock_KHz) + 50U;
    }


    if(_FLD2VAL(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_FORMAT, gfxss_dc->DCNANO.GCREGFRAMEBUFFERCONFIG) == 4U)
    {
        bytes_per_pixel_framebuffer = RGB_32_BIT_PIXEL_FORMAT_IN_BYTES;
    }
    if(_FLD2VAL(GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_FORMAT, gfxss_dc->DCNANO.GCREGOVERLAYCONFIG) == 4U)
    {
        bytes_per_pixel_overlay = RGB_32_BIT_PIXEL_FORMAT_IN_BYTES;
    }
    if(_FLD2VAL(GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_FORMAT, gfxss_dc->DCNANO.GCREGOVERLAYCONFIG1) == 4U)
    {
        bytes_per_pixel_overlay1 = RGB_32_BIT_PIXEL_FORMAT_IN_BYTES;
    }

    No_of_lines = (uint32_t)(DBI_SCLICE_LIMIT_IN_BYTES / (horizontal_resolution * bytes_per_pixel_dc_output));
    
    mipi_dsi_base->DWCMIPIDSI.DBI_CMDSIZE = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_WR_CMD_SIZE , (No_of_lines * bytes_per_pixel_dc_output * horizontal_resolution) + 1U ) |
                                   _VAL2FLD( GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_ALLOWED_CMD_SIZE , ((uint8_t)(AXI_BURST_LENGTH / bytes_per_pixel_dc_output)) * bytes_per_pixel_dc_output + 1U);
    mipi_dsi_base->DWCMIPIDSI.DBI_CFG = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_OUT_DBI_CONF , context->mipidsi_context.dpi_fmt) | 
                                   _VAL2FLD( GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_IN_DBI_CONF , context->mipidsi_context.dpi_fmt);

    if ((horizontal_resolution * bytes_per_pixel_framebuffer) % AXI_BURST_LENGTH != 0U)
    {
        line_stride = AXI_BURST_LENGTH * (((horizontal_resolution * bytes_per_pixel_framebuffer) / AXI_BURST_LENGTH) + 1);
    }
    else
    {
        line_stride = horizontal_resolution * bytes_per_pixel_framebuffer;
        
    }

    if ((horizontal_resolution * bytes_per_pixel_overlay) % AXI_BURST_LENGTH != 0U)
    {
        line_stride_overlay = AXI_BURST_LENGTH * (((horizontal_resolution * bytes_per_pixel_overlay) / AXI_BURST_LENGTH) + 1);
    }
    else
    {
        line_stride_overlay = horizontal_resolution * bytes_per_pixel_overlay;
    }

    if ((horizontal_resolution * bytes_per_pixel_overlay1) % AXI_BURST_LENGTH != 0U)
    {
        line_stride_overlay1 = AXI_BURST_LENGTH * (((horizontal_resolution * bytes_per_pixel_overlay1) / AXI_BURST_LENGTH) + 1);
    }
    else
    {
        line_stride_overlay1 = horizontal_resolution * bytes_per_pixel_overlay1;
    }

    gfxss_dc->DCNANO.GCREGFRAMEBUFFERSTRIDE = line_stride;
    gfxss_dc->DCNANO.GCREGOVERLAYSTRIDE = line_stride_overlay;
    gfxss_dc->DCNANO.GCREGOVERLAYSTRIDE1 = line_stride_overlay1;
    gfxss_dc->DCNANO.GCREGFRAMEBUFFERSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_HEIGHT, No_of_lines);
    gfxss_dc->DCNANO.GCREGOVERLAYSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_HEIGHT, No_of_lines);
    gfxss_dc->DCNANO.GCREGOVERLAYSIZE1 = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_HEIGHT, No_of_lines);
    gfxss_dc->DCNANO.GCREGVDISPLAY = _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_DISPLAY_END, No_of_lines) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_TOTAL, (No_of_lines + 1));
    gfxss_dc->DCNANO.GCREGVSYNC =  _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_START, 0U ) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_END,  No_of_lines);

    packet_col_address[0] = 0x2A;
    packet_col_address[1] = 0x00;
    packet_col_address[2] = 0x00;
    packet_col_address[3] = ( (horizontal_resolution - 1) >> 8) & 0xff;
    packet_col_address[4] = ( (horizontal_resolution - 1) & 0xff);

    packet_row_address[0] = 0x2B;

    for(i = 0; i < vertical_resolution-No_of_lines; i += No_of_lines){

        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_col_address[0], 5);

        packet_row_address[1] = ((j * No_of_lines) >> 8) & 0xff;
        packet_row_address[2] =  (j * No_of_lines) & 0xff ;
        packet_row_address[3] = (( (j * No_of_lines) + (No_of_lines - 1) ) >> 8) & 0xff;
        packet_row_address[4] =  ( (j * No_of_lines) + (No_of_lines - 1) ) & 0xff;
        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_row_address[0], 5);

        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_ADDRESS, 0x2C); // send data
        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_MEM, 0x0);

        Cy_SysLib_Rtos_DelayUs(rtos_delay_us);

        gfxss_dc->DCNANO.GCREGFRAMEBUFFERADDRESS += (No_of_lines * line_stride);
        gfxss_dc->DCNANO.GCREGOVERLAYADDRESS += (No_of_lines * line_stride_overlay);
        gfxss_dc->DCNANO.GCREGOVERLAYADDRESS1 += (No_of_lines * line_stride_overlay1);
        j++;
    }

    No_of_lines = vertical_resolution % No_of_lines;

    if(No_of_lines > 0 )
    {
        mipi_dsi_base->DWCMIPIDSI.DBI_CMDSIZE = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_WR_CMD_SIZE , (No_of_lines * bytes_per_pixel_dc_output * horizontal_resolution) + 1U ) |
                                       _VAL2FLD( GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_ALLOWED_CMD_SIZE , ((uint8_t)(AXI_BURST_LENGTH / bytes_per_pixel_dc_output)) * bytes_per_pixel_dc_output + 1U);

        gfxss_dc->DCNANO.GCREGFRAMEBUFFERSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_HEIGHT, No_of_lines);
        gfxss_dc->DCNANO.GCREGOVERLAYSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_HEIGHT, No_of_lines);
        gfxss_dc->DCNANO.GCREGOVERLAYSIZE1 = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_HEIGHT, No_of_lines);
        gfxss_dc->DCNANO.GCREGVDISPLAY = _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_DISPLAY_END, No_of_lines) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_TOTAL, (No_of_lines + 1));
        gfxss_dc->DCNANO.GCREGVSYNC =  _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_START, 0U ) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_END,  No_of_lines);

        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_col_address[0], 5);

        packet_row_address[1] = ((vertical_resolution - No_of_lines) >> 8) & 0xff;
        packet_row_address[2] = (vertical_resolution - No_of_lines) & 0xff;
        packet_row_address[3] = ((vertical_resolution - 1) >> 8) & 0xff;
        packet_row_address[4] = (vertical_resolution - 1) & 0xff;
        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_row_address[0], 5);

        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_ADDRESS, 0x2C); // send data
        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_MEM, 0x0);

        Cy_SysLib_Rtos_Delay(1);
    }
        return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_TransferPartialFrame(GFXSS_Type *base, uint32_t start_line_offset, uint32_t end_line_offset, cy_stc_gfx_context_t *context) {
    
    CY_ASSERT(base != NULL);
    CY_ASSERT(context != NULL);
    // Check if start_line_offset and end_line_offset is in required vertical length of display panel
    CY_ASSERT(start_line_offset < end_line_offset);
    CY_ASSERT(end_line_offset <= context->dc_context.display_height);

    GFXSS_DC_Type *gfxss_dc =    &(base->GFXSS_DC);
    GFXSS_MIPIDSI_Type *mipi_dsi_base = &(base->GFXSS_MIPIDSI);
    uint32_t partial_size = (end_line_offset - start_line_offset);

    uint8_t packet_col_address[5], packet_row_address[5];
    uint32_t horizontal_resolution = context->dc_context.display_width;
    uint32_t No_of_lines = 0, i = 0, line_stride = 0, line_stride_overlay = 0, line_stride_overlay1 = 0;

    uint8_t bytes_per_pixel_framebuffer = RGB_16_BIT_PIXEL_FORMAT_IN_BYTES;    
    float bytes_per_pixel_dc_output = 0;
    uint8_t bytes_per_pixel_overlay = RGB_16_BIT_PIXEL_FORMAT_IN_BYTES;
    uint8_t bytes_per_pixel_overlay1 = RGB_16_BIT_PIXEL_FORMAT_IN_BYTES;
    uint32_t rtos_delay_us = 0;

    switch(context->dc_context.display_format)
    {
    case vivD8R3G3B2:
	case vivD16R3G3B2:
         bytes_per_pixel_dc_output = 1.0f;
         break;
    case vivD8R4G4B4:
    case vivD16R4G4B4:
         bytes_per_pixel_dc_output = 1.5f;
         break;
    case vivD8R5G6B5:
    case vivD16R5G6B5:
         bytes_per_pixel_dc_output = 2.0f;
         break;
    case vivD8R6G6B6:
    case vivD9R6G6B6:
    case vivD16R6G6B6OP1:
    case vivD16R6G6B6OP2:
         bytes_per_pixel_dc_output = 2.25f;
         break;
    case vivD8R8G8B8:
    case vivD16R8G8B8OP1:
    case vivD16R8G8B8OP2:
         bytes_per_pixel_dc_output = 3.0f;
         break;

    default:
         bytes_per_pixel_dc_output = 2.0f;
         break;
    }

    /*Dc_dbitypeab_div_int == dc_gcregdbiwrchar1_dbi_wr_period * (m_dc_gcregdbiconfig_dbi_ac_time_unit +1);
    500 Mbps per lane
    500/8 = 62.5 MHz lane byte clock
    max DBI clock should be 1/4th of lane byte clock = 15.625 MHz
    Divider value close to 15.625 MHz = 13 for 15.38 Mhz */
    uint32_t lane_byte_clock_KHz = (context->mipidsi_context.per_lane_mbps * 1000U) / 8U;  /* 500000/8 = 62500 KHz lane byte clock*/
    uint32_t dbi_clock_KHz = lane_byte_clock_KHz / 4U;                           /* Max DBI clock should be 1/4th of lane byte clock = 62500 / 4 = 15625 KHz*/
    uint32_t dsi_clock_KHz = context->clockHz / 2000U;                     /* DSI internal divider of 2 and conversion to KHz, dsi clock = (400000000 / 2) / 1000 MHz = 200000 KHz*/
    uint32_t divider = (dsi_clock_KHz + dbi_clock_KHz - 1) / dbi_clock_KHz;      /* ceil of divider value dsi_clock_KHz / dbi_clock_KHz = 200000 / 15625 = 13*/
    divider < 3 ? divider = 3 : divider;       /* minimum value for divider is 3*/
    dbi_clock_KHz = dsi_clock_KHz / divider;   /* calculate dbi clock value after divider */

