legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
    gfxss_dc->DCNANO.GCREGDBIWRCHAR1 &= ~GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_PERIOD_Msk;
    gfxss_dc->DCNANO.GCREGDBIWRCHAR1 |= _VAL2FLD(GFXSS_DC_DCNANO_GCREGDBIWRCHAR1_GCREGDBIWRCHAR1_DBI_WR_PERIOD, divider);

    if ((context->dc_context.display_format == vivD16R8G8B8OP1) || (context->dc_context.display_format == vivD16R8G8B8OP2))
    {
        rtos_delay_us = ((DBI_SCLICE_LIMIT_IN_BYTES * 1000U / 2U) / dbi_clock_KHz) + 50U;
    }
    else
    {
        rtos_delay_us = ((DBI_SCLICE_LIMIT_IN_BYTES * 1000U )/ dbi_clock_KHz) + 50U;
    }


    if(_FLD2VAL(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERCONFIG_GCREGFRAMEBUFFERCONFIG_FORMAT, gfxss_dc->DCNANO.GCREGFRAMEBUFFERCONFIG) == 4U)
    {
        bytes_per_pixel_framebuffer = RGB_32_BIT_PIXEL_FORMAT_IN_BYTES;
    }
    if(_FLD2VAL(GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG_GCREGOVERLAYCONFIG_FORMAT, gfxss_dc->DCNANO.GCREGOVERLAYCONFIG) == 4U)
    {
        bytes_per_pixel_overlay = RGB_32_BIT_PIXEL_FORMAT_IN_BYTES;
    }
    if(_FLD2VAL(GFXSS_DC_DCNANO_GCREGOVERLAYCONFIG1_GCREGOVERLAYCONFIG1_FORMAT, gfxss_dc->DCNANO.GCREGOVERLAYCONFIG1) == 4U)
    {
        bytes_per_pixel_overlay1 = RGB_32_BIT_PIXEL_FORMAT_IN_BYTES;
    }

    No_of_lines = (uint32_t)(DBI_SCLICE_LIMIT_IN_BYTES / (horizontal_resolution * bytes_per_pixel_dc_output));
        if (No_of_lines > (end_line_offset - start_line_offset)) {
        No_of_lines = end_line_offset - start_line_offset;
    }
    mipi_dsi_base->DWCMIPIDSI.DBI_CMDSIZE = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_WR_CMD_SIZE , (No_of_lines * bytes_per_pixel_dc_output * horizontal_resolution) + 1U ) |
                                   _VAL2FLD( GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_ALLOWED_CMD_SIZE , ((uint8_t)(AXI_BURST_LENGTH / bytes_per_pixel_dc_output)) * bytes_per_pixel_dc_output + 1U);
    mipi_dsi_base->DWCMIPIDSI.DBI_CFG = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_OUT_DBI_CONF , context->mipidsi_context.dpi_fmt) | 
                                   _VAL2FLD( GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CFG_DBI_CFG_IN_DBI_CONF , context->mipidsi_context.dpi_fmt);

    if ((horizontal_resolution * bytes_per_pixel_framebuffer) % AXI_BURST_LENGTH != 0U)
    {
        line_stride = AXI_BURST_LENGTH * (((horizontal_resolution * bytes_per_pixel_framebuffer) / AXI_BURST_LENGTH) + 1);
    }
    else
    {
        line_stride = horizontal_resolution * bytes_per_pixel_framebuffer;
        
    }

    if ((horizontal_resolution * bytes_per_pixel_overlay) % AXI_BURST_LENGTH != 0U)
    {
        line_stride_overlay = AXI_BURST_LENGTH * (((horizontal_resolution * bytes_per_pixel_overlay) / AXI_BURST_LENGTH) + 1);
    }
    else
    {
        line_stride_overlay = horizontal_resolution * bytes_per_pixel_overlay;
    }

    if ((horizontal_resolution * bytes_per_pixel_overlay1) % AXI_BURST_LENGTH != 0U)
    {
        line_stride_overlay1 = AXI_BURST_LENGTH * (((horizontal_resolution * bytes_per_pixel_overlay1) / AXI_BURST_LENGTH) + 1);
    }
    else
    {
        line_stride_overlay1 = horizontal_resolution * bytes_per_pixel_overlay1;
    }

    // Configure frame buffer for partial transfer based on total number of lines in possible for command buffer
    gfxss_dc->DCNANO.GCREGFRAMEBUFFERADDRESS = (uint32_t) context->dc_context.gfx_layer_config.buffer_address;
    gfxss_dc->DCNANO.GCREGFRAMEBUFFERADDRESS += (start_line_offset * line_stride);
    gfxss_dc->DCNANO.GCREGFRAMEBUFFERSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_HEIGHT, No_of_lines);
    gfxss_dc->DCNANO.GCREGFRAMEBUFFERSTRIDE = line_stride;
    gfxss_dc->DCNANO.GCREGOVERLAYSTRIDE = line_stride_overlay;
    gfxss_dc->DCNANO.GCREGOVERLAYSTRIDE1 = line_stride_overlay1;
    gfxss_dc->DCNANO.GCREGFRAMEBUFFERSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_HEIGHT, No_of_lines);
    gfxss_dc->DCNANO.GCREGOVERLAYSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_HEIGHT, No_of_lines);
    gfxss_dc->DCNANO.GCREGOVERLAYSIZE1 = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_HEIGHT, No_of_lines);
    gfxss_dc->DCNANO.GCREGVDISPLAY = _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_DISPLAY_END, No_of_lines) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_TOTAL, (No_of_lines + 1));
    gfxss_dc->DCNANO.GCREGVSYNC =  _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_START, 0U ) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_END,  No_of_lines);

    packet_col_address[0] = 0x2A;
    packet_col_address[1] = 0x00;
    packet_col_address[2] = 0x00;
    packet_col_address[3] = ( (horizontal_resolution - 1) >> 8) & 0xff;
    packet_col_address[4] = ( (horizontal_resolution - 1) & 0xff);

    packet_row_address[0] = 0x2B;
    for(i = No_of_lines; i <= partial_size; i += No_of_lines){

        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_col_address[0], 5);

        packet_row_address[1] = ((start_line_offset) >> 8) & 0xff;
        packet_row_address[2] =  (start_line_offset) & 0xff ;
        packet_row_address[3] = ((start_line_offset + (No_of_lines - 1) ) >> 8) & 0xff;
        packet_row_address[4] =  ( start_line_offset + (No_of_lines - 1) ) & 0xff;
        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_row_address[0], 5);

        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_ADDRESS, 0x2C); // send data
        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_MEM, 0x0);

        Cy_SysLib_Rtos_DelayUs(rtos_delay_us);
        start_line_offset += (No_of_lines);
       // Update frame buffer addresses for specified range
        gfxss_dc->DCNANO.GCREGFRAMEBUFFERADDRESS += (No_of_lines * line_stride);
        gfxss_dc->DCNANO.GCREGOVERLAYADDRESS += (No_of_lines * line_stride_overlay);
        gfxss_dc->DCNANO.GCREGOVERLAYADDRESS1 += (No_of_lines * line_stride_overlay1);
    
