legalstark/psoc-e84-ai-kit-rtthread/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/third_party/COMPONENT_GFXSS/cy_graphics.c
    }

    // Remaining number of lines 
    No_of_lines = partial_size % No_of_lines;


    if(No_of_lines > 0 )
    {
        // Configure delay required to transfer remaining number of lines
        if ((context->dc_context.display_format == vivD16R8G8B8OP1) || (context->dc_context.display_format == vivD16R8G8B8OP2))
        {
            rtos_delay_us = ((No_of_lines *line_stride * 1000U / 2U) / dbi_clock_KHz) + 50U;
        }
        else
        {
            rtos_delay_us = ((No_of_lines * line_stride * 1000U )/ dbi_clock_KHz) + 50U;
        } 

        // Update frame buffer for remaining number of lines
        mipi_dsi_base->DWCMIPIDSI.DBI_CMDSIZE = _VAL2FLD(GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_WR_CMD_SIZE , (No_of_lines * bytes_per_pixel_dc_output * horizontal_resolution) + 1U ) |
                                       _VAL2FLD( GFXSS_MIPIDSI_DWCMIPIDSI_DBI_CMDSIZE_DBI_CMDSIZE_ALLOWED_CMD_SIZE , ((uint8_t)(AXI_BURST_LENGTH / bytes_per_pixel_dc_output)) * bytes_per_pixel_dc_output + 1U);

        gfxss_dc->DCNANO.GCREGFRAMEBUFFERSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGFRAMEBUFFERSIZE_GCREGFRAMEBUFFERSIZE_HEIGHT, No_of_lines);
        gfxss_dc->DCNANO.GCREGOVERLAYSIZE = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE_GCREGOVERLAYSIZE_HEIGHT, No_of_lines);
        gfxss_dc->DCNANO.GCREGOVERLAYSIZE1 = _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_WIDTH, horizontal_resolution) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGOVERLAYSIZE1_GCREGOVERLAYSIZE1_HEIGHT, No_of_lines);
        gfxss_dc->DCNANO.GCREGVDISPLAY = _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_DISPLAY_END, No_of_lines) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVDISPLAY_GCREGVDISPLAY_TOTAL, (No_of_lines + 1));
        gfxss_dc->DCNANO.GCREGVSYNC =  _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_START, 0U ) | _VAL2FLD(GFXSS_DC_DCNANO_GCREGVSYNC_GCREGVSYNC_END,  No_of_lines);

        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_col_address[0], 5);

        packet_row_address[1] = ((end_line_offset - No_of_lines) >> 8) & 0xff;
        packet_row_address[2] = (end_line_offset - No_of_lines) & 0xff;
        packet_row_address[3] = ((end_line_offset - 1) >> 8) & 0xff;
        packet_row_address[4] = (end_line_offset - 1) & 0xff;
        (void)Cy_MIPIDSI_WritePacket(mipi_dsi_base, &packet_row_address[0], 5);

        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_ADDRESS, 0x2C); // send data
        viv_hw_display_dbi_set_command(DC_CORE->hardware, context->dc_context.display_format, vivDBI_COMMAND_MEM, 0x0);

        Cy_SysLib_Rtos_DelayUs(rtos_delay_us);
    }
        return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_Enable_GPU( GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);
    uint32_t timeout = CY_GFXSS_TOTAL_NO_OF_RETRIES;
    GFXSS_GPU_Type *gpu_base = &(base->GFXSS_GPU);

    if(gpu_base != NULL)
    {
        gpu_base->MXGPU.CTL |= GFXSS_GPU_MXGPU_CTL_ENABLED_Msk;
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }

    while ((_FLD2VAL(GFXSS_GPU_MXGPU_STATUS_CORE_RST, gpu_base->MXGPU.STATUS) != 0U) && ( timeout > 0u))
    {
        Cy_SysLib_DelayUs(CY_GFXSS_WAIT_1_UNIT);
        timeout--;
    }
    if(_FLD2VAL(GFXSS_GPU_MXGPU_STATUS_CORE_RST, gpu_base->MXGPU.STATUS) != 0U)
    {
        return CY_GFX_TIMEOUT;
    }
    context->gpu_context.enabled = true;
    return CY_GFX_SUCCESS;
}

cy_en_gfx_status_t Cy_GFXSS_Disable_GPU( GFXSS_Type *base, cy_stc_gfx_context_t *context)
{
    CY_ASSERT(base != NULL);
    uint32_t timeout = CY_GFXSS_TOTAL_NO_OF_RETRIES;
    GFXSS_GPU_Type *gpu_base = &(base->GFXSS_GPU);

    if(gpu_base != NULL)
    {
        while((gpu_base->GCNANO.AQHIIDLE & GPU_IDLE_MASK ) != GPU_IDLE_MASK );
        gpu_base->MXGPU.CTL &= ~GFXSS_GPU_MXGPU_CTL_ENABLED_Msk;
    }
    else
    {
        return CY_GFX_BAD_PARAM;
    }

    while ((_FLD2VAL(GFXSS_GPU_MXGPU_STATUS_CORE_RST, gpu_base->MXGPU.STATUS) != 1U) && ( timeout > 0u))
    {
        Cy_SysLib_DelayUs(CY_GFXSS_WAIT_1_UNIT);
        timeout--;
    }
    if(_FLD2VAL(GFXSS_GPU_MXGPU_STATUS_CORE_RST, gpu_base->MXGPU.STATUS) != 1U)
    {
        return CY_GFX_TIMEOUT;
    }
    context->gpu_context.enabled = false;
    return CY_GFX_SUCCESS;
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22GFXSS */
/* [] END OF FILE */
